app/controllers/articles_controller.rb

  def index
    @articles = Article.all()
---
SELECT "articles".* FROM "articles"

  def destroy
    @article = Article.find(params[:id])
    @article.destroy()
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 1]]